/*
 * led_status_ctrl.c
 * 本文用于对LED驱动控制进行具体实现
 *
 *  Created on: 2018年8月17日
 *      Author: NJ
 */

#include "led_status_ctrl.h"

/**************************************************
 * @function 驱动创建和初始化函数
 *
 * @param	address 设备基地址
 *
 **************************************************/
void LedDriver_Create(uint16_t *address)
{
	*address = 0;
}

/**************************************************
 * @function 驱动回收函数
 *
 * @param	none
 *
 **************************************************/
void LedDriver_Destroy(void)
{

}

/**************************************************
 * @function 驱动创建和初始化函数
 *
 * @param	address 设备基地址
 *
 **************************************************/

